IdeaRS.OpenModel.Message.IDEAProgressReport
Data for progress report of IOM

IdeaRS.OpenModel.Message.IDEAProgressReport.CurrentProgressAmount
current progress

IdeaRS.OpenModel.Message.IDEAProgressReport.TotalProgressAmount
total progress

IdeaRS.OpenModel.Message.IDEAProgressReport.CurrentProgressMessage
some message to pass to the UI of current progress